{"title":"A trip in lsd","slug":"lsd","img":"/blog/lsd.jpg","tags":["#review","#pop"],"summary":"A psychodelical trip into an emotional and surrealist world of colours and flavors from three known artists, a new arrival of bubblegum pop and neo-psychodelia.","html":"\n\t\t\t<p>The most expected album of the year, atleast for me, <b> LSD </b> came in April,12 and broke out all the expectations with a fresh syle and innovative.</p>\n\t\t\t<p> Got a nice audience since its single <b> Genius </b>, a neo psychodelic style with the soft melodies of <b> Sia </b> and <b> Labyrinth </b> along with a great harmony from <b> Diplo </b> and some catchy-pop lyrics, that, until now i cant stop singing them in the shower.\n\t\t\t<p> With the arrival of <b> Thunderclouds </b> they had paved a road, i expected a conceptual album, and the video came to me for surprise, a surrealist interpretation of the principal characters of the album, and, at the same time, a new path to follow by each one of the pilars of this story </p>\n\t\t\t<p> This album, when i first listened to it, it was unexpected, i got myself inmersed into a experimental melody of neo-psychodelia with a presentation like that of <i> some kind of magic </i> or <i> Welcome to the world of plastic beach </i> both from gorillaz, the presentation of a new world, showing o you a new musical product unique and amazing you with some guitar riffs just arriving the first song <b> Welcome to the wonderful world of </b>. The voices created an ambient and great melody, with lyrics talking about world and trips with a twist, some songs depicting that feelings are <b> Thunderclouds </b>, <b> Its Time </b> and <b> Genius </b>,\n\t\t\tthis masterpiece consists in a return of what was the bubblegum pop of the 80s with some subtle voices from <b> Sia </b> electronic melodies from <b> Diplo </b> and at the same time modern rythmn with some effects like glitch and danceable sounds.\n\t\t\tA sweet rythmn floats all over the album and waves between sweet tones and happy ones, each songs leaves you wanting for more and you can feel it, not only as a pop danceable song, but even more, in the emotional spectrum </p>\n\t\t\t<p> This album could make a difference, bringing back that psychodelic style, like that of tame imapala or with that acid style of grimes, and even, influentiate many bands from the pop genre... </p>\n\t\t"}