{"posts":[{"title":"Glitch and GlitchCore","img":"/blog/music girl.jpg","slug":"glitchcore","summary":"A summary of the story of glitchcore (Cover by me)","tags":["#critique","#article","#glitch","#glitchcore","#electronic"],"md":"\n\nMany genres come from small underground scenes, the same way many rock subgenres started in small garages and local movements, and this is the case for **glitchcore** and **glitchhop** in general\n\n### VaporWave\nIn 2010 _Vaporwave_ started banging our speakers and youtube recommendations, for someone who was really into glitch music with artists like the _the glitch mob_, and _crosses †††_ , and loved the glitch aesthetic, the same art i was doing and sharing, glitch was many times called wrongly \"vapor wave\", vapor wave represented a softer melody, like ambient, with smaller jumps, almost not scratches and overall, a pastel aesthetic using some  1990s elements, more like a leaning towards a more vintage side, the difference was pretty obvious, but is not like there were some big parameters to difference between one or the another, only for people who cared about the genres and styles.\n\n\n### Chiptune\n_Chiptune_ was a pet genre, from time you could listen to some of these beats on small artists, _nintendocore_ got a more wider audience from britain and europe, with that 8bits style but with more drum and bass influence.\n\n### Glitch Predecessors\nFor glitch it was almost the same case, small artists using these jumps, scratches and recording errors and sampling, saturating, etc. In clubs and mixes, artists like _autechre_  and _coil_, while others like _the glitch mob_, used this sound and embraced it, using it as a trademark, the glitch mob sound was more house-like, deviating from rave styles and getting more elements of artists like _deadmou5_.\n\n\n### GlitchCore\nNow in 2021-2022, we are getting almost the same issue, _Glitchcore_ was a a really old genre, that was like a step further from  _drill and bass_, _chiptune_, _nintendocore_ an most important, _breakcore_ and _glitch hop_. \n\n_GlitchCore_ was a step further, not only it was a more stronger genre, faster tempo (like way faster speed, 170-190+) but more elements, aggresive drums, inclusion of noise, and others elements, artists like _Venetian Snares_, _bong-ra_ and _igorr_ played with the genre between their breakcore eps, and later artists like _sewerslvt, lolishit, vertigoaway, machinegrl_, and others, embraced the genre, using it as main style and even in aesthetics, most of them used anime elements fused with glitch designs of oversaturated colors and chopped pictures, until now, for anybody who wants to get into that genre, he can can just listen to some sewerslvt, is one of the best doors for that big palace of musical abstraction.\n\nKnowing about how these movements shaped the music we have now is big, it is product of iteration and iteration, experimentation over years, maybe decades, while also, helping label subgenres and tying knots in the history of music, even artists from the pop scene (like grimes) got influenced by that style of glitch and used it.\n\nAnother issue here is, do we have objective ways of labeling genres? Kinda, we get to label these by ear most of the times, like \"it may be this because sounds like this song\", and we can be wrong, in the case of glitchcore, the tempo, and use of musical elements play a big part, but there are many other genres in the suffix of -core in the electronic nature that we may confuse.\n","html":"<p>Many genres come from small underground scenes, the same way many rock subgenres started in small garages and local movements, and this is the case for <strong>glitchcore</strong> and <strong>glitchhop</strong> in general</p>\n<h3 id=\"vaporwave\">VaporWave</h3>\n<p>In 2010 <em>Vaporwave</em> started banging our speakers and youtube recommendations, for someone who was really into glitch music with artists like the <em>the glitch mob</em>, and <em>crosses †††</em> , and loved the glitch aesthetic, the same art i was doing and sharing, glitch was many times called wrongly \"vapor wave\", vapor wave represented a softer melody, like ambient, with smaller jumps, almost not scratches and overall, a pastel aesthetic using some  1990s elements, more like a leaning towards a more vintage side, the difference was pretty obvious, but is not like there were some big parameters to difference between one or the another, only for people who cared about the genres and styles.</p>\n<h3 id=\"chiptune\">Chiptune</h3>\n<p><em>Chiptune</em> was a pet genre, from time you could listen to some of these beats on small artists, <em>nintendocore</em> got a more wider audience from britain and europe, with that 8bits style but with more drum and bass influence.</p>\n<h3 id=\"glitchpredecessors\">Glitch Predecessors</h3>\n<p>For glitch it was almost the same case, small artists using these jumps, scratches and recording errors and sampling, saturating, etc. In clubs and mixes, artists like <em>autechre</em>  and <em>coil</em>, while others like <em>the glitch mob</em>, used this sound and embraced it, using it as a trademark, the glitch mob sound was more house-like, deviating from rave styles and getting more elements of artists like <em>deadmou5</em>.</p>\n<h3 id=\"glitchcore\">GlitchCore</h3>\n<p>Now in 2021-2022, we are getting almost the same issue, <em>Glitchcore</em> was a a really old genre, that was like a step further from  <em>drill and bass</em>, <em>chiptune</em>, <em>nintendocore</em> an most important, <em>breakcore</em> and <em>glitch hop</em>. </p>\n<p><em>GlitchCore</em> was a step further, not only it was a more stronger genre, faster tempo (like way faster speed, 170-190+) but more elements, aggresive drums, inclusion of noise, and others elements, artists like <em>Venetian Snares</em>, <em>bong-ra</em> and <em>igorr</em> played with the genre between their breakcore eps, and later artists like <em>sewerslvt, lolishit, vertigoaway, machinegrl</em>, and others, embraced the genre, using it as main style and even in aesthetics, most of them used anime elements fused with glitch designs of oversaturated colors and chopped pictures, until now, for anybody who wants to get into that genre, he can can just listen to some sewerslvt, is one of the best doors for that big palace of musical abstraction.</p>\n<p>Knowing about how these movements shaped the music we have now is big, it is product of iteration and iteration, experimentation over years, maybe decades, while also, helping label subgenres and tying knots in the history of music, even artists from the pop scene (like grimes) got influenced by that style of glitch and used it.</p>\n<p>Another issue here is, do we have objective ways of labeling genres? Kinda, we get to label these by ear most of the times, like \"it may be this because sounds like this song\", and we can be wrong, in the case of glitchcore, the tempo, and use of musical elements play a big part, but there are many other genres in the suffix of -core in the electronic nature that we may confuse.</p>"},{"title":"Noise/Girl - Discopathology","img":"/blog/noise_girl.jpg","slug":"noise_girl","summary":"Powerful noise dance album ","tags":["#electronic","#powernoise","#noise","#experimental","#harsh"],"md":"\n\nWell, it starts like any other noise album,white noise, but man, these samples, these melodies, for sure are catchy, long time without listening to some power noise album, has a nice set of drums, sounds raw, aggresive, and has that little spice of industrial that just hits the right spot\n_Smoke n' mirrorz_ is a trip between harsh noise and a crazy set of drums glitching between sides\n_Discopathology_ sounds like a good disco song, which you would dance in some oldschool rave, excepting that is full of white noise, anxiety and power electronics, but has a nice constituted, processed melody, with some breakdowns, nice and fresh\n\nNot much to say about this small album, but made me return to this blog so... for sure is a lot lol\n","html":"<p>Well, it starts like any other noise album,white noise, but man, these samples, these melodies, for sure are catchy, long time without listening to some power noise album, has a nice set of drums, sounds raw, aggresive, and has that little spice of industrial that just hits the right spot\n<em>Smoke n' mirrorz</em> is a trip between harsh noise and a crazy set of drums glitching between sides\n<em>Discopathology</em> sounds like a good disco song, which you would dance in some oldschool rave, excepting that is full of white noise, anxiety and power electronics, but has a nice constituted, processed melody, with some breakdowns, nice and fresh</p>\n<p>Not much to say about this small album, but made me return to this blog so… for sure is a lot lol</p>"},{"title":"Unkle - War Stories","img":"/blog/unkle.jpg","slug":"Unkle","summary":"An upbeat downbeat album","tags":["#electronic","#triphop","#alternative","#downtempo"],"md":"\n\nBasically, is a trip hop band, with a more fast style, at the peak, between the lines of downtempo and alternative, and i love trip hop.\n\nMost trip hop bands have some style, something that differentiates them, portishead had these fast beats on slow songs, tricky has that dark rhythm, sick beats and raspy lyrics of rap\n\nWar stories is a consistent album, all songs has that cohesive instrumental melody, starting with a cloud of sounds, a misty trip hop beat, and going forward with a more faster tempo, all the songs follow this pattern, and the issue with trip hop is the fact that most songs sound repetitive, or even boring if you arent into these ambiental slow beats, but unkle knows how to manage that pretty well, _twillight_ is their slower song, and stills grows in that increasing pace, not harder, but more ambiental, or spiritual, like would do radiohead on kid a.\n\n_hold my hand, restless and keys to the kingdom_ are great singles and examples of that style, thst limbo he makes, how a song grows from a downtempo beat, a trip hop style to a more experimental, - alternative one, including rock, electronics, and even some noise, you can compare it with moby, but in unkle, some songs like, for example flute and string from moby grow exponentially to machete from the same artist. Unkle is richer on experimentation, yes, but doesnt make moby a weak artist, just someone who knows how to stamp their differences into their albums and songs. \n\n_Price you pay_ is another slow song by unkle, instrumental, some ethereal lyrics, and a little of anxiety in the background accompanied with high string tones, until it grows to a more aggressive approach, stamped onto a 4/4 battery.\n\nUnkle is a master piece of the trip hop, and alternative, a mix of both, and  this albums implies the border and inspiration for some great works of these genres.\n","html":"<p>Basically, is a trip hop band, with a more fast style, at the peak, between the lines of downtempo and alternative, and i love trip hop.</p>\n<p>Most trip hop bands have some style, something that differentiates them, portishead had these fast beats on slow songs, tricky has that dark rhythm, sick beats and raspy lyrics of rap</p>\n<p>War stories is a consistent album, all songs has that cohesive instrumental melody, starting with a cloud of sounds, a misty trip hop beat, and going forward with a more faster tempo, all the songs follow this pattern, and the issue with trip hop is the fact that most songs sound repetitive, or even boring if you arent into these ambiental slow beats, but unkle knows how to manage that pretty well, <em>twillight</em> is their slower song, and stills grows in that increasing pace, not harder, but more ambiental, or spiritual, like would do radiohead on kid a.</p>\n<p><em>hold my hand, restless and keys to the kingdom</em> are great singles and examples of that style, thst limbo he makes, how a song grows from a downtempo beat, a trip hop style to a more experimental, - alternative one, including rock, electronics, and even some noise, you can compare it with moby, but in unkle, some songs like, for example flute and string from moby grow exponentially to machete from the same artist. Unkle is richer on experimentation, yes, but doesnt make moby a weak artist, just someone who knows how to stamp their differences into their albums and songs. </p>\n<p><em>Price you pay</em> is another slow song by unkle, instrumental, some ethereal lyrics, and a little of anxiety in the background accompanied with high string tones, until it grows to a more aggressive approach, stamped onto a 4/4 battery.</p>\n<p>Unkle is a master piece of the trip hop, and alternative, a mix of both, and  this albums implies the border and inspiration for some great works of these genres.</p>"},{"title":"Zero 7 - Simple Things","img":"/blog/zero7.jpg","slug":"SimpleThings","summary":"Trip hop downtempo album","tags":["#triphop","#electronic","#downtempo","#sia"],"md":"\nI have been a fan of trip hop since a long time, being one of my favs genres, so.. imagine liking harsh noise and trip hop... yes...\nAnd Zero 7 is one of the most complete bands in that genre, an this album, i may say that is the peak of said band, they have more electronic works than anyhing else, in this album we can listen to a wide variety of downtempo inmersive beats, for me, this is bliss\ndestiny and waiting line show Sia voice, yes, Sia, which adds a more pop sound without getting out from the vibes of the album\n\ndistractions is a sweet foam of candies over a downtempo beat, the atmosphere is excelent, but you get overly inmersed when she says \"i love you\"\n\nthe album is one of the master pieces of trip hop in general, and also, a sleeper, over subestimated and not that known, but if you like air, or portishead, this is your next step\n\n","html":"<p>I have been a fan of trip hop since a long time, being one of my favs genres, so.. imagine liking harsh noise and trip hop… yes…\nAnd Zero 7 is one of the most complete bands in that genre, an this album, i may say that is the peak of said band, they have more electronic works than anyhing else, in this album we can listen to a wide variety of downtempo inmersive beats, for me, this is bliss\ndestiny and waiting line show Sia voice, yes, Sia, which adds a more pop sound without getting out from the vibes of the album</p>\n<p>distractions is a sweet foam of candies over a downtempo beat, the atmosphere is excelent, but you get overly inmersed when she says \"i love you\"</p>\n<p>the album is one of the master pieces of trip hop in general, and also, a sleeper, over subestimated and not that known, but if you like air, or portishead, this is your next step</p>"},{"title":"Black Dresses - Forever in your heart","img":"/blog/blackdresses.jpg","slug":"blackdresses","summary":"industrial - noise album with a punk or pop thematic","tags":["#metal","#electronic","#noise","#industrial","#harshnoise"],"md":"\nWell... lately in this century, metal has turned a little poppy or has fused with more poppy genres like trap, rap, punk rock, etc, one example of this, is poppy, an artist that has catchy pop sounds with an inmersive metal background, or the all so lovely babymetal.\nand this album, despite this drowns into a more industrial scene.\n\nThis album starts with a harsh intro of noise and industrial, metal percusion and strident melodies with screams, going harder and deeper with each song.\npeacesign!! doesnt gets less melodious, is still a great intro, not too aggresive, but with a nice shock factor,  i mean _concrete bubble_ starts with some aangsty screams showing big signs of anxiety and sharing them, the album gets softer with the time, being the last two songs _mistake_ and _(cant) keep it together_ being softer and more poppy with just normal electronic industrial\n\nthe album shows a new angle to modern industrial, getting more noisy and more pop - punk but with the same feelings of anxiety, despair, a great album indeed\n\n","html":"<p>Well… lately in this century, metal has turned a little poppy or has fused with more poppy genres like trap, rap, punk rock, etc, one example of this, is poppy, an artist that has catchy pop sounds with an inmersive metal background, or the all so lovely babymetal.\nand this album, despite this drowns into a more industrial scene.</p>\n<p>This album starts with a harsh intro of noise and industrial, metal percusion and strident melodies with screams, going harder and deeper with each song.\npeacesign!! doesnt gets less melodious, is still a great intro, not too aggresive, but with a nice shock factor,  i mean <em>concrete bubble</em> starts with some aangsty screams showing big signs of anxiety and sharing them, the album gets softer with the time, being the last two songs <em>mistake</em> and <em>(cant) keep it together</em> being softer and more poppy with just normal electronic industrial</p>\n<p>the album shows a new angle to modern industrial, getting more noisy and more pop - punk but with the same feelings of anxiety, despair, a great album indeed</p>"}],"actualTag":[{"name":"#electronic","slug":"electronic"}]}