{"posts":[{"title":"Skating Polly - Fuzz Steilacoom","slug":"Skating-polly","img":"/blog/skating-polly.jpeg","tags":["#obscure","#review","#grunge","#garage"],"summary":"Grunge, Teen angst, and all that from a group of highschool teenagers","md":"\n\nThis album made me rethink about if grunge is really dead, maybe it is, but this, is a new wave for it, and would strike again the charts.\n\nI dont say that this album would become a top seller, but has the energy, the emotion, the production, of a good grunge-garage rock album, even for a sixteen girl and her friends, the fuzz of the guitars feel excelent, invigorant, the drums remind me of dave grohl, has that **hole** energy, but i kind of like this artist over hole... (not a big fan of Courtney) The vocals are soft, tender when they have to be, overall in the other albums, being this one the most hard of them all, with sturdy vocals, hard screams, and a wall of noise that pushes you over.","html":"<p>This album made me rethink about if grunge is really dead, maybe it is, but this, is a new wave for it, and would strike again the charts.</p>\n<p>I dont say that this album would become a top seller, but has the energy, the emotion, the production, of a good grunge-garage rock album, even for a sixteen girl and her friends, the fuzz of the guitars feel excelent, invigorant, the drums remind me of dave grohl, has that <strong>hole</strong> energy, but i kind of like this artist over hole… (not a big fan of Courtney) The vocals are soft, tender when they have to be, overall in the other albums, being this one the most hard of them all, with sturdy vocals, hard screams, and a wall of noise that pushes you over.</p>"},{"title":"Noir Desir - Des Visages Des figures","img":"/blog/noir-desir.jpg","slug":"noir-desir","tags":["#review","#obscure","#noise","#garage"],"summary":"The noise rock - garage album that made me want to learn french, The inner experience inside the emotions of a common man","html":"<p>I could describe the album as the garage interpretation of the daily life of a sensible man, understanding more and more about his feelings, but that would be too ambiguous and short.\nAnd doesnt make enough justice for the album</p>\n\n<p>This is a journey, an album that varies and plays with noise, instruments, and voices, bertrand cantat does a great job, choosing diferent tones for his voices in different songs, Des visages des figures and L'Appartment shows a softer voice, intropective, emotional. Le grand incendie shows a heavier tone, and L'Enfant Roi, opens the album, using a thin falsetto in a repetitive kind of trippy instrumental, about just, a piece of a normal life.</p>\n\n\t\t<p>All the album is full of different metaphores to life, playing with many images and at the same time depicting just, ordinary moments.</p>\n\n<p>Le grand incendie shows a strident harmonica playing in company of stepped hard  drums, many references to riots, or atleast, just, liberation, until the words \"cour\" appear into place, meaning a rift of water, yelling at the microphone, just increasing the noise in the song, until the last explosion of instruments bursting the harmony.</p>\n\n<p>Lost, which made me fall in love completely, is at first, just a note, an inner observation of loneliness... which ends in desesperation, he plays in a complete amazing way with emotions, his voice becomes raspy or hoarse while the song pases, while in the song, he starts talking more about psychological consequences... Until he explodes, the image of the single is really amazing, a doodle of a wolf barking at.. anything, or whatever that appears in the picture, which does a good job explaining the song at first. the song becomes harder, faster, and he loses it, he screams to the listener i'm lost</p>\n\n<p>The album does a great job in production, harmony and message, its style is something complex, not boring or repetitive, and even experimental, and the band is kind of obscure outside France, one of my favorites gems.</p>\t"}],"actualTag":[{"name":"#garage","slug":"garage"}]}