{"posts":[{"title":"Thou and Emma Rundle","img":"/blog/thou.jpg","slug":"thou","summary":"Thou and Emma Ruth Rundle, and how to make a soft strong post metal album","tags":["#Blackgaze","#Doom","#Stoner","#Metal","#Post Metal","#noise"],"md":"\n\nMay our chambers be full is a doom - blackgaze - stoner album that just resonates with some melodic soft voices from this thou companion, Emma Ruth Rundle\n\nI love the influence of shoegaze at every songstart, _killing floor and monolith_ are some soft clouds arriving in the skies, passing, melancholic, emotional, ending in a storm of screams and piercing chants from Emma\n\nThe notes at _ancestral Recall_ are hold, every word she sings, until the guttural hits, and you are reminded, that this is not a not a blackgaze or post metal album, that this song hits hard on the stoner metal spectrum, getting blackened for every guitar riff, drum and scream.\n\nand we arrive on _Magickal Cost_ Magical indeed, a soft song, like a ballad from the cranberries, getting over a rapid battery tempo, the songs roll around a formula, softer to heavy. Is the album repetitive? Yes but no, while the songs may follow a pattern, and the album is organized in some industrial flavor, high to low to high, the sound is so new, amazing, and rich, i havent listened to anything similar since _Brando_ or _bull_ from the collaborative album of sco))tt (scott walker ft sunn o))) maybe, kaada and patton, but, the first one, went with an ominous, sometimes scary, uneasy sound towards are more noisy one with melodic voices, this album, flows from a melodic sound, emotional, and swims towards a more aggresive one, in a heavy metal strike.\n\n_The valley_ is desperation, anxiety, a crawl of a soft mellody flowing through.\n\nIn the case of **The Helm of Sorrows**\nIt hits harder, a more sturdy begginning with strong screams and an impenetrable noise wall, and a haunting melody in the back in _Orphan Limbs_\n\nThe rest of the album is more fast paced, _recurrence_ is a strong song, full of power, with some melodic parts\n\nAnd finishing in one song, that made me check the album, hollywood, is just a master piece of post metal - blackgaze - doom, the voice is catchy, soft, the sound is danceable, melodic, and drags you to the highs and lows of the song, and the emotions depicted.\n\nThis is a style i crave, something not much abused, and a mix of blackgaze with melodic voices and stoner is so amazing, since alcest starting touching a more high level of listeners, solstafir, but obviously, artists like boris and sunn o)) ft scott, is so invigorating emotionally, and doesnt brings you down like a doom song, but rather keeps you floating in a sea of noisy foam.\n","html":"<p>May our chambers be full is a doom - blackgaze - stoner album that just resonates with some melodic soft voices from this thou companion, Emma Ruth Rundle</p>\n<p>I love the influence of shoegaze at every songstart, <em>killing floor and monolith</em> are some soft clouds arriving in the skies, passing, melancholic, emotional, ending in a storm of screams and piercing chants from Emma</p>\n<p>The notes at <em>ancestral Recall</em> are hold, every word she sings, until the guttural hits, and you are reminded, that this is not a not a blackgaze or post metal album, that this song hits hard on the stoner metal spectrum, getting blackened for every guitar riff, drum and scream.</p>\n<p>and we arrive on <em>Magickal Cost</em> Magical indeed, a soft song, like a ballad from the cranberries, getting over a rapid battery tempo, the songs roll around a formula, softer to heavy. Is the album repetitive? Yes but no, while the songs may follow a pattern, and the album is organized in some industrial flavor, high to low to high, the sound is so new, amazing, and rich, i havent listened to anything similar since <em>Brando</em> or <em>bull</em> from the collaborative album of sco))tt (scott walker ft sunn o))) maybe, kaada and patton, but, the first one, went with an ominous, sometimes scary, uneasy sound towards are more noisy one with melodic voices, this album, flows from a melodic sound, emotional, and swims towards a more aggresive one, in a heavy metal strike.</p>\n<p><em>The valley</em> is desperation, anxiety, a crawl of a soft mellody flowing through.</p>\n<p>In the case of <strong>The Helm of Sorrows</strong>\nIt hits harder, a more sturdy begginning with strong screams and an impenetrable noise wall, and a haunting melody in the back in <em>Orphan Limbs</em></p>\n<p>The rest of the album is more fast paced, <em>recurrence</em> is a strong song, full of power, with some melodic parts</p>\n<p>And finishing in one song, that made me check the album, hollywood, is just a master piece of post metal - blackgaze - doom, the voice is catchy, soft, the sound is danceable, melodic, and drags you to the highs and lows of the song, and the emotions depicted.</p>\n<p>This is a style i crave, something not much abused, and a mix of blackgaze with melodic voices and stoner is so amazing, since alcest starting touching a more high level of listeners, solstafir, but obviously, artists like boris and sunn o)) ft scott, is so invigorating emotionally, and doesnt brings you down like a doom song, but rather keeps you floating in a sea of noisy foam.</p>"},{"title":"Noise/Girl - Discopathology","img":"/blog/noise_girl.jpg","slug":"noise_girl","summary":"Powerful noise dance album ","tags":["#electronic","#powernoise","#noise","#experimental","#harsh"],"md":"\n\nWell, it starts like any other noise album,white noise, but man, these samples, these melodies, for sure are catchy, long time without listening to some power noise album, has a nice set of drums, sounds raw, aggresive, and has that little spice of industrial that just hits the right spot\n_Smoke n' mirrorz_ is a trip between harsh noise and a crazy set of drums glitching between sides\n_Discopathology_ sounds like a good disco song, which you would dance in some oldschool rave, excepting that is full of white noise, anxiety and power electronics, but has a nice constituted, processed melody, with some breakdowns, nice and fresh\n\nNot much to say about this small album, but made me return to this blog so... for sure is a lot lol\n","html":"<p>Well, it starts like any other noise album,white noise, but man, these samples, these melodies, for sure are catchy, long time without listening to some power noise album, has a nice set of drums, sounds raw, aggresive, and has that little spice of industrial that just hits the right spot\n<em>Smoke n' mirrorz</em> is a trip between harsh noise and a crazy set of drums glitching between sides\n<em>Discopathology</em> sounds like a good disco song, which you would dance in some oldschool rave, excepting that is full of white noise, anxiety and power electronics, but has a nice constituted, processed melody, with some breakdowns, nice and fresh</p>\n<p>Not much to say about this small album, but made me return to this blog so… for sure is a lot lol</p>"},{"title":"Black Dresses - Forever in your heart","img":"/blog/blackdresses.jpg","slug":"blackdresses","summary":"industrial - noise album with a punk or pop thematic","tags":["#metal","#electronic","#noise","#industrial","#harshnoise"],"md":"\nWell... lately in this century, metal has turned a little poppy or has fused with more poppy genres like trap, rap, punk rock, etc, one example of this, is poppy, an artist that has catchy pop sounds with an inmersive metal background, or the all so lovely babymetal.\nand this album, despite this drowns into a more industrial scene.\n\nThis album starts with a harsh intro of noise and industrial, metal percusion and strident melodies with screams, going harder and deeper with each song.\npeacesign!! doesnt gets less melodious, is still a great intro, not too aggresive, but with a nice shock factor,  i mean _concrete bubble_ starts with some aangsty screams showing big signs of anxiety and sharing them, the album gets softer with the time, being the last two songs _mistake_ and _(cant) keep it together_ being softer and more poppy with just normal electronic industrial\n\nthe album shows a new angle to modern industrial, getting more noisy and more pop - punk but with the same feelings of anxiety, despair, a great album indeed\n\n","html":"<p>Well… lately in this century, metal has turned a little poppy or has fused with more poppy genres like trap, rap, punk rock, etc, one example of this, is poppy, an artist that has catchy pop sounds with an inmersive metal background, or the all so lovely babymetal.\nand this album, despite this drowns into a more industrial scene.</p>\n<p>This album starts with a harsh intro of noise and industrial, metal percusion and strident melodies with screams, going harder and deeper with each song.\npeacesign!! doesnt gets less melodious, is still a great intro, not too aggresive, but with a nice shock factor,  i mean <em>concrete bubble</em> starts with some aangsty screams showing big signs of anxiety and sharing them, the album gets softer with the time, being the last two songs <em>mistake</em> and <em>(cant) keep it together</em> being softer and more poppy with just normal electronic industrial</p>\n<p>the album shows a new angle to modern industrial, getting more noisy and more pop - punk but with the same feelings of anxiety, despair, a great album indeed</p>"},{"title":"The Body - I dont ever want to be alone","img":"/blog/body.jpg","slug":"the-body","summary":"Noise packed horror - noise - power electronics","tags":["#electronics","#noise","#metal","#powerelectronics","#experimental","underground"],"md":"\nNoise since the start of the album, some intro is passed and so comes a big fuzz which accompanies all the songs,\n\nriffs,\ndrums\nscreeches\nand more can be said about this chaotic album which surprised me, startled would i say\n\n__What Have I Let The World Make Of Me __ Being the most consistent piece, some riffs at a dissonant tempo and a classic moombaton sound in the background\n\nI feel deeply sorry for the lack of context, just listen to this emotional horror noise album, you will really like it if you are into this kind of stuff\n","html":"<p>Noise since the start of the album, some intro is passed and so comes a big fuzz which accompanies all the songs,</p>\n<p>riffs,\ndrums\nscreeches\nand more can be said about this chaotic album which surprised me, startled would i say</p>\n<p>__What Have I Let The World Make Of Me __ Being the most consistent piece, some riffs at a dissonant tempo and a classic moombaton sound in the background</p>\n<p>I feel deeply sorry for the lack of context, just listen to this emotional horror noise album, you will really like it if you are into this kind of stuff</p>"},{"title":"Midori (ミドリ) - Aratamemashite, Hajimemashite, Midori Desu","img":"/blog/midori.jpg","slug":"midori","summary":"For me, the epitome of japanese punk jazz ","tags":["#jazz","#noise","#punk","#japanese","#experimental"],"md":"\nOne of my favs bands, that can crash into a soft voice with a soothing piano to a harsh screamo punk\n\nThe first song of the album is a soothing guitar melody which also depicts the soft voice of this frontman, one of the best i have seen in concerts.\nFollowed by a harsh aggresive song, __ゆきこさん__ , also named __Yukiko-san__ which starts the first two seconds with an strident scream, i dont understand japanese that well, but is not needed to understand, to feel the emotions in the songs, the voice changes, and the variant rythmn.\n\nThe variant, experimental harmony in the songs make such a background, how all the instruments seem like improvising in company, and how the main focus is obviously, midori voice\nBut honestly, i think the most important fact about the band, is the energetic voice of the singer, dancing and trashing all around the scenary.\nHighly recommended for avant garde fans.\n","html":"<p>One of my favs bands, that can crash into a soft voice with a soothing piano to a harsh screamo punk</p>\n<p>The first song of the album is a soothing guitar melody which also depicts the soft voice of this frontman, one of the best i have seen in concerts.\nFollowed by a harsh aggresive song, <strong>ゆきこさん</strong> , also named <strong>Yukiko-san</strong> which starts the first two seconds with an strident scream, i dont understand japanese that well, but is not needed to understand, to feel the emotions in the songs, the voice changes, and the variant rythmn.</p>\n<p>The variant, experimental harmony in the songs make such a background, how all the instruments seem like improvising in company, and how the main focus is obviously, midori voice\nBut honestly, i think the most important fact about the band, is the energetic voice of the singer, dancing and trashing all around the scenary.\nHighly recommended for avant garde fans.</p>"},{"title":"Arca - Kick I","img":"/blog/arca.png","slug":"arca","summary":"Experimental pop album, bunch of electronics, with a trasgender concept and touching the margins of reggaeton in this heavy masterpiece","tags":["#pop","#noise","#electronics","#reggaeton","#experimental"],"md":"\nAt first i didnt wanted to check on this album, i appreciate Arca work, he is a beast live, great producer and as an amazing concept in her music.\n\nBut also i tend to feel deply connected, not only because i feel like i can understand her deeply, words, style, struggle, (not that im a trans)but also has a style with some drops of **sophie**, some of **bjork**, etc..\n\nWell the album, it goes in progression, the arrangement of songs is excelent, i was expecting that collab with **Rosalia**, and **KLK** brought it to me, which made me wantto listen the album... is a harsh experimental - gitchy sound with a moombatoon - reggaeton melody, catchy and at the same time further the ring\n\nbut the song which made me into it was **machote**, that song is not only... hilarious to me, but also, take a relisen to it, is a struggle, a song made from loneliness and the seek of these pinches of pleasure\n\nhas that old sound of arca, some depresso - warm melody in its lyrics. nice stuff\n\nNow, for the sound that left me speechless, **Afterwards**, was unexpected, i had to check my playlist again to see if i wasnt listening to **bjork**, and i was... that collab was just too strong, not all experimental artists have that pleasure, this pushes this album over the scale\n\n","html":"<p>At first i didnt wanted to check on this album, i appreciate Arca work, he is a beast live, great producer and as an amazing concept in her music.</p>\n<p>But also i tend to feel deply connected, not only because i feel like i can understand her deeply, words, style, struggle, (not that im a trans)but also has a style with some drops of <strong>sophie</strong>, some of <strong>bjork</strong>, etc..</p>\n<p>Well the album, it goes in progression, the arrangement of songs is excelent, i was expecting that collab with <strong>Rosalia</strong>, and <strong>KLK</strong> brought it to me, which made me wantto listen the album… is a harsh experimental - gitchy sound with a moombatoon - reggaeton melody, catchy and at the same time further the ring</p>\n<p>but the song which made me into it was <strong>machote</strong>, that song is not only… hilarious to me, but also, take a relisen to it, is a struggle, a song made from loneliness and the seek of these pinches of pleasure</p>\n<p>has that old sound of arca, some depresso - warm melody in its lyrics. nice stuff</p>\n<p>Now, for the sound that left me speechless, <strong>Afterwards</strong>, was unexpected, i had to check my playlist again to see if i wasnt listening to <strong>bjork</strong>, and i was… that collab was just too strong, not all experimental artists have that pleasure, this pushes this album over the scale</p>"},{"title":"春ねむり 【Haru Nemuri】 - Haru To Shura","img":"/blog/haru.jpg","slug":"haru-to-shura","summary":"A noise packed hazy album, full of hard guitar riffs, and aggressive drums, in a dream pop - noise rock album","tags":["#pop","#noise","#rock","#dreampop","#japanese"],"md":"\nI have been a big fan of japanese experimental music, like kyo, ningen isu, and avantgarde, they have a way of blending.... or playing with dissonant harmonies, and this album, does that.\nthis album, well the single; **yume wo mijou** made me want to look for the album, sadly, it was hard to look for some kanji symbols... but at last, found it, an album packed with a noise accompanied vocals in progression\nand emotionally charged yellings to the modern life.\nthe electronics used in the album makes a soft background along with the noisy parts and harsh riffs,\nhas some kind of generic sound in some songs, but its progression in some songs like narashite, by using a faster pace it does change the sentiment of the song and the style of the album in general, \nbut by changing some style at the end of some songs doesnt make the album more appealing, it can sounds a litte too repetitive or generic, and the voice of the girl, despite the many changes of pitch doesnt make the effect that some others noise rock albums use.\nGreat album, can be real trip at first listening, but is not that fresh as it may sounds conceptually speaking\n\n","html":"<p>I have been a big fan of japanese experimental music, like kyo, ningen isu, and avantgarde, they have a way of blending…. or playing with dissonant harmonies, and this album, does that.\nthis album, well the single; <strong>yume wo mijou</strong> made me want to look for the album, sadly, it was hard to look for some kanji symbols… but at last, found it, an album packed with a noise accompanied vocals in progression\nand emotionally charged yellings to the modern life.\nthe electronics used in the album makes a soft background along with the noisy parts and harsh riffs,\nhas some kind of generic sound in some songs, but its progression in some songs like narashite, by using a faster pace it does change the sentiment of the song and the style of the album in general, \nbut by changing some style at the end of some songs doesnt make the album more appealing, it can sounds a litte too repetitive or generic, and the voice of the girl, despite the many changes of pitch doesnt make the effect that some others noise rock albums use.\nGreat album, can be real trip at first listening, but is not that fresh as it may sounds conceptually speaking</p>"},{"title":"Nothing - Dance on the Blacktop","img":"/blog/nothing.jpg","slug":"nothing","summary":"A new wave of darkgaze is getting into the sounds of doom metal, black and others...","tags":["#obscure","#noise","#doom"],"md":"\nWell first thing first, i love **RelapseRecords** I mean, they have brought many doom - stoner bands like **Red fang** or **Kylesa** and **nothing** is not an exception of that style, A doom style into a blackgaze band, the vocals are great, raw and changing, and just a velvet cape of noise mesmerizes your senses with energy of black and doom metal, great  stuff, feels harsh, at the kind of solstafir but at the same time not tha heavy like you would get from the first albums of solstafir or merzbow.\n\n","html":"<p>Well first thing first, i love <strong>RelapseRecords</strong> I mean, they have brought many doom - stoner bands like <strong>Red fang</strong> or <strong>Kylesa</strong> and <strong>nothing</strong> is not an exception of that style, A doom style into a blackgaze band, the vocals are great, raw and changing, and just a velvet cape of noise mesmerizes your senses with energy of black and doom metal, great  stuff, feels harsh, at the kind of solstafir but at the same time not tha heavy like you would get from the first albums of solstafir or merzbow.</p>"},{"title":"Noir Desir - Des Visages Des figures","img":"/blog/noir-desir.jpg","slug":"noir-desir","tags":["#review","#obscure","#noise","#garage"],"summary":"The noise rock - garage album that made me want to learn french, The inner experience inside the emotions of a common man","html":"<p>I could describe the album as the garage interpretation of the daily life of a sensible man, understanding more and more about his feelings, but that would be too ambiguous and short.\nAnd doesnt make enough justice for the album</p>\n\n<p>This is a journey, an album that varies and plays with noise, instruments, and voices, bertrand cantat does a great job, choosing diferent tones for his voices in different songs, Des visages des figures and L'Appartment shows a softer voice, intropective, emotional. Le grand incendie shows a heavier tone, and L'Enfant Roi, opens the album, using a thin falsetto in a repetitive kind of trippy instrumental, about just, a piece of a normal life.</p>\n\n\t\t<p>All the album is full of different metaphores to life, playing with many images and at the same time depicting just, ordinary moments.</p>\n\n<p>Le grand incendie shows a strident harmonica playing in company of stepped hard  drums, many references to riots, or atleast, just, liberation, until the words \"cour\" appear into place, meaning a rift of water, yelling at the microphone, just increasing the noise in the song, until the last explosion of instruments bursting the harmony.</p>\n\n<p>Lost, which made me fall in love completely, is at first, just a note, an inner observation of loneliness... which ends in desesperation, he plays in a complete amazing way with emotions, his voice becomes raspy or hoarse while the song pases, while in the song, he starts talking more about psychological consequences... Until he explodes, the image of the single is really amazing, a doodle of a wolf barking at.. anything, or whatever that appears in the picture, which does a good job explaining the song at first. the song becomes harder, faster, and he loses it, he screams to the listener i'm lost</p>\n\n<p>The album does a great job in production, harmony and message, its style is something complex, not boring or repetitive, and even experimental, and the band is kind of obscure outside France, one of my favorites gems.</p>\t"}],"actualTag":[{"name":"#noise","slug":"noise"}]}